app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "text", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "First Article"], ["text", "This is the first Article."], ["created_at", "2020-04-28 18:29:09.861802"], ["updated_at", "2020-04-28 18:29:09.861802"], ["user_id", 6]]
---
    def create
        @article = Article.new(article_params)
        @article.user = current_user

        if @article.save